apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_usbdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>
#include <stdint.h>
#include <stdio.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>
#include <nuttx/usb/cdc.h>
#include <nuttx/serial/serial.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>
#include <arch/chip/types.h>

#include "chip.h"
#include "renesas_internal.h"
#include "rx65n_usbdev.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#if defined(CONFIG_USBHOST) && defined(CONFIG_USBDEV)
#  error "Both USB Host & Device cannot be configured"
#endif

#ifndef  CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

#define RX65N_NENDPOINTS      (8)
#define EP0                   (0)
#define EP1                   (1)
#define EP2                   (2)
#define EP3                   (3)
#define EP4                   (4)
#define EP5                   (5)
#define EP6                   (6)
#define EP7                   (7)

#define RX65N_ENDP_BIT(ep)    (1 << (ep))
#define RX65N_ENDP_ALLSET     0xff

#define RX65N_MAXPACKET_SHIFT (6)
#define RX65N_MAXPACKET_SIZE  (1 << (RX65N_MAXPACKET_SHIFT))
#define RX65N_MAXPACKET_MASK  (RX65N_MAXPACKET_SIZE-1)

#define RX65N_EP0MAXPACKET    RX65N_MAXPACKET_SIZE

#define REQRECIPIENT_MASK     (USB_REQ_TYPE_MASK | USB_REQ_RECIPIENT_MASK)

/* Debug ********************************************************************/

/* Trace error codes */

#define RX65N_TRACEERR_ALLOCFAIL         0x0001
#define RX65N_TRACEERR_ATTACHIRQ         0x0002
#define RX65N_TRACEERR_BINDFAILED        0x0003
#define RX65N_TRACEERR_DRIVER            0x0004
#define RX65N_TRACEERR_DRIVERREGISTERED  0x0005
#define RX65N_TRACEERR_EPREAD            0x0006
#define RX65N_TRACEERR_EWRITE            0x0007
#define RX65N_TRACEERR_INVALIDPARMS      0x0008
#define RX65N_TRACEERR_NOEP              0x0009
#define RX65N_TRACEERR_NOTCONFIGURED     0x000a
#define RX65N_TRACEERR_NULLPACKET        0x000b
#define RX65N_TRACEERR_NULLREQUEST       0x000c
#define RX65N_TRACEERR_REQABORTED        0x000d
#define RX65N_TRACEERR_STALLEDCLRFEATURE 0x000e
#define RX65N_TRACEERR_STALLEDISPATCH    0x000f
#define RX65N_TRACEERR_STALLEDGETST      0x0010
#define RX65N_TRACEERR_STALLEDGETSTEP    0x0011
#define RX65N_TRACEERR_STALLEDGETSTRECIP 0x0012
#define RX65N_TRACEERR_STALLEDREQUEST    0x0013
#define RX65N_TRACEERR_STALLEDSETFEATURE 0x0014
#define RX65N_TRACEERR_BADGETCONFIG      0x0015
#define RX65N_TRACEERR_IRQREGISTRATION   0x001a
#define RX65N_TRACEERR_DISPATCHSTALL     0x001b
#define RX65N_TRACEERR_INVALIDCTRLREQ    0x001c
#define RX65N_TRACEERR_BADEPTYPE         0x001d
#define RX65N_TRACEERR_BADEPNO           0x001e
#define RX65N_TRACEERR_EPRESERVE         0x001f
#define RX65N_TRACEERR_BADSETCONFIG      0x0020

/* Trace interrupt codes */

#define RX65N_TRACEINTID_CLEARFEATURE    0x0001
#define RX65N_TRACEINTID_CONTROL         0x0002
#define RX65N_TRACEINTID_DISPATCH        0x0003
#define RX65N_TRACEINTID_GETENDPOINT     0x0004
#define RX65N_TRACEINTID_GETIFDEV        0x0005
#define RX65N_TRACEINTID_GETSETDESC      0x0006
#define RX65N_TRACEINTID_GETSETIFCONFIG  0x0007
#define RX65N_TRACEINTID_GETSTATUS       0x0008
#define RX65N_TRACEINTID_RESUME          0x0009
#define RX65N_TRACEINTID_SETADDRESS      0x000a
#define RX65N_TRACEINTID_SETFEATURE      0x000b
#define RX65N_TRACEINTID_SUSPEND         0x000c
#define RX65N_TRACEINTID_SYNCHFRAME      0x000d
#define RX65N_TRACEINTID_TESTMODE        0x000e
#define RX65N_TRACEINTID_TXFIFOSTALL     0x000f
#define RX65N_TRACEINTID_GETCONFIG       0x0010
#define RX65N_TRACEINTID_EPINQEMPTY      0x0011
#define RX65N_TRACEINTID_EPOUTQEMPTY     0x0012
#define RX65N_TRACEINTID_NOSTDREQ        0x0013
#define RX65N_TRACEINTID_SETCONFIG       0x0014
#define RX65N_TRACEINTID_GETSETIF        0x0015

/* Hardware interface *******************************************************/

/* This driver supports the one interrupt IN, one bulk IN
 * and one bulk OUT endpoint.
 */

/* Hardware dependent sizes and numbers */

#define RX65N_BULKMAXPACKET     64          /* Bulk endpoint max packet */
#define RX65N_INTRMAXPACKET     64          /* Interrupt endpoint max packet */

/* Endpoint numbers */

#define RX65N_EP0                0          /* Control endpoint */
#define RX65N_EPBULKIN           1          /* Bulk EP for send to host */
#define RX65N_EPBULKOUT          2          /* Bulk EP for recv to host */
#define RX65N_EPINTRIN           3          /* Intr EP for host poll */

/* Request queue operations *************************************************/

#define rx65n_rqempty(ep)       ((ep)->head == NULL)
#define rx65n_rqpeek(ep)        ((ep)->head)

#  define LSB 0
#  define MSB 1

/****************************************************************************
 * Private Types
 ****************************************************************************/

