apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
/* A container for a request so that the request make be retained in a list */

struct rx65n_req_s
{
  struct usbdev_req_s    req;           /* Standard USB request */
  struct rx65n_req_s    *flink;         /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct rx65n_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct rx65n_ep_s.
   */

  struct usbdev_ep_s     ep;            /* Standard endpoint structure */

  /* RX65N-specific fields */

  struct rx65n_usbdev_s *dev;           /* Reference to private driver data */
  struct rx65n_req_s    *head;          /* Request list for this endpoint */
  struct rx65n_req_s    *tail;
  uint8_t                epphy;         /* Physical EP address/index */
  uint8_t                stalled:1;     /* Endpoint is halted */
  uint8_t                in:1;          /* Endpoint is IN only */
  uint8_t                txbusy:1;      /* 1: TX endpoint FIFO full */
  uint8_t                halted:1;      /* Endpoint feature halted */
  uint8_t                txnullpkt:1;   /* Null packet needed at end of transfer */
};

/* This structure encapsulates the overall driver state */

struct rx65n_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to struct rx65n_usbdev_s.
   */

  struct usbdev_s        usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* RX65N-specific fields */

  uint8_t                stalled:1;     /* 1: Protocol stalled */
#ifdef CONFIG_USBDEV_SELFPOWERED
  uint8_t                selfpowered:1; /* 1: Device is self powered */
#endif
  uint8_t                epavail;       /* Bitset of available endpoints */
  uint8_t                paddrset:1;    /* 1: Peripheral addr has been set */
  uint8_t                attached:1;    /* 1: Host attached */
  uint8_t                rxpending:1;   /* 1: RX pending */
  uint8_t                paddr;         /* Peripheral address */
  uint8_t                ep0state;

  struct work_s    rx65n_interrupt_bhalf;
  struct usb_ctrlreq_s   ctrl;

  /* The endpoint list */

  struct rx65n_ep_s      eplist[RX65N_NENDPOINTS];
};

/* For maintaining tables of endpoint info */

struct rx65n_epinfo_s
{
  uint8_t                addr;          /* Logical endpoint address */
  uint8_t                attr;          /* Endpoint attributes */
  uint8_t                fifo;          /* FIFO mx pkt size + dual buffer bits */
#ifdef CONFIG_USBDEV_HIGHSPEED
  uint16_t               maxpacket;     /* Max packet size */
#else
  uint8_t                maxpacket;     /* Max packet size */
#endif
};

union wb_u
{
  uint16_t w;
  uint8_t  b[2];
};

uint16_t g_usb_pstd_req_type;          /* Type */
uint16_t g_usb_pstd_req_value;         /* Value */
uint16_t g_usb_pstd_req_index;         /* Index */
uint16_t g_usb_pstd_req_length;        /* Length */

uint32_t g_usb_pstd_data_cnt[USB_MAXPIPE_NUM + 1u];
uint8_t  *gp_usb_pstd_data[USB_MAXPIPE_NUM + 1u];
uint16_t g_usb_pstd_remote_wakeup = USB_FALSE;
uint16_t g_usb_pstd_test_mode_flag = USB_FALSE;         /* Test mode flag */
uint16_t g_usb_pstd_test_mode_select;

int bytesread = 0;

struct usb_utr
{
    uint16_t    keyword;        /* Root port / Device address / Pipe number */
    uint8_t     *p_tranadr;     /* Transfer data Start address */
    uint32_t    tranlen;        /* Transfer data length */
};

struct usb_utr *g_p_usb_pstd_pipe[USB_MAXPIPE_NUM + 1u];
struct usb_utr g_usb_pdata[USB_MAXPIPE_NUM + 1];
uint16_t g_usb_pstd_stall_pipe[USB_MAX_PIPE_NO + 1u];
uint8_t g_buffer[64] ;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations */

#  define rx65n_getreg8(addr)      getreg8(addr)
#  define rx65n_getreg16(addr)     getreg16(addr)
#  define rx65n_getreg32(addr)     getreg32(addr)
#  define rx65n_putreg8(val,addr)  putreg8(val,addr)
#  define rx65n_putreg16(val,addr) putreg16(val,addr)
#  define rx65n_putreg32(val,addr) putreg32(val,addr)

/* Request queue operations *************************************************/

struct rx65n_req_s *rx65n_rqdequeue(struct rx65n_ep_s *privep);
static void rx65n_rqenqueue(struct rx65n_ep_s *privep, struct
                            rx65n_req_s *req);

/* Low level data transfers and request operations */

static void rx65n_epwrite(uint8_t epno, struct rx65n_usbdev_s *priv,
                          struct rx65n_ep_s *privep, uint8_t *buf,
                          uint32_t nbytes);
static int  rx65n_epread(uint8_t epno, struct rx65n_usbdev_s *priv,
                         uint8_t *buf, uint16_t nbytes);
static inline void rx65n_abortrequest(struct rx65n_ep_s *privep,
                                      struct rx65n_req_s *privreq,
                                      int16_t result);
static void rx65n_reqcomplete(struct rx65n_ep_s *privep, int16_t result);
static int  rx65n_wrrequest(uint8_t epno, struct rx65n_usbdev_s *priv,
                            struct rx65n_ep_s *privep);
static int  rx65n_rdrequest(uint8_t epno, struct rx65n_usbdev_s *priv,
                            struct rx65n_ep_s *privep);

/* Interrupt handling */

static void rx65n_dispatchrequest(struct rx65n_usbdev_s *priv);
void rx65n_ep0setup(struct rx65n_usbdev_s *priv);
static int  rx65n_usbinterrupt(int irq, void *context, void *arg);

/* Endpoint methods */

static int  rx65n_epconfigure(struct usbdev_ep_s *ep,
                              const struct usb_epdesc_s *desc, bool last);
static int  rx65n_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *rx65n_epallocreq(struct usbdev_ep_s *ep);
static void rx65n_epfreereq(struct usbdev_ep_s *ep,
                            struct usbdev_req_s *req);
static int  rx65n_epsubmit(struct usbdev_ep_s *ep,
                           struct usbdev_req_s *privreq);
static int  rx65n_epcancel(struct usbdev_ep_s *ep,
                           struct usbdev_req_s *privreq);
static void rx65n_cancelrequests(struct rx65n_ep_s *privep);

/* USB device controller methods */

