apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
static void hw_usb_set_mbw(uint16_t pipemode, uint16_t data)
{
  uint16_t *p_reg;

  p_reg = hw_usb_get_fifosel_adr(pipemode);

  (*p_reg) &= (~USB_MBW);
  if (0 != data)
    {
      (*p_reg) |= data;
    }
}

/****************************************************************************
 * Name: hw_usb_set_bclr
 *
 * Description:
 *   Set BCLR bit
 *
 ****************************************************************************/

static void hw_usb_set_bclr(uint16_t pipemode)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifoctr_adr(pipemode);

  *p_reg = USB_BCLR;
}

/****************************************************************************
 * Name: hw_usb_read_fifoctr
 *
 * Description:
 *   Read FIFOCTR Register
 *
 ****************************************************************************/

static uint16_t hw_usb_read_fifoctr(uint16_t pipemode)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifoctr_adr(pipemode);

  return *p_reg;
}

/****************************************************************************
 * Name: hw_usb_read_syscfg
 *
 * Description:
 *   Set Read SYSCFG Register
 *
 ****************************************************************************/

static uint16_t hw_usb_read_syscfg(void)
{
  return rx65n_getreg16(RX65N_USB_SYSCFG);
}

/****************************************************************************
 * Name: usb_cstd_is_set_frdy
 *
 * Description:
 *   Set FRDY bit
 *
 ****************************************************************************/

static uint16_t usb_cstd_is_set_frdy(uint16_t pipe, uint16_t fifosel,
                                     uint16_t isel)
{
  uint16_t buf;
  uint16_t i;

  /* Changes the FIFO port by the pipe. */

  usb_cstd_chg_curpipe(pipe, fifosel, isel);

  /* WAIT_LOOP */

  for (i = 0; i < 4; i++)
    {
      buf = hw_usb_read_fifoctr(fifosel);

      if (USB_FRDY == (uint16_t)(buf & USB_FRDY))
        {
          return buf;
        }

      buf = hw_usb_read_syscfg();
      buf = hw_usb_read_syssts();
    }

  return USB_ERROR;
}

/****************************************************************************
 * Name: hw_usb_read_dcpmaxp
 *
 * Description:
 *   Read DCPMAXP Register
 *
 ****************************************************************************/

static uint16_t hw_usb_read_dcpmaxp(void)
{
  return rx65n_getreg16(RX65N_USB_DCPMAXP);
}

/****************************************************************************
 * Name: hw_usb_read_pipemaxp
 *
 * Description:
 *   Read PIPEMAXP Register
 *
 ****************************************************************************/

static uint16_t hw_usb_read_pipemaxp(void)
{
  return rx65n_getreg16(RX65N_USB_PIPEMAXP);
}

/****************************************************************************
 * Name: usb_cstd_get_buf_size
 *
 * Description:
 *   Get buf size
 *
 ****************************************************************************/

static uint16_t usb_cstd_get_buf_size(uint16_t pipe)
{
  uint16_t size;
  uint16_t buf;

  if (USB_PIPE0 == pipe)
    {
      buf = hw_usb_read_dcpmaxp();

      /* Max Packet Size */

     size = (uint16_t)(buf & USB_MAXP);
    }
  else
    {
      /* Pipe select */

      hw_usb_write_pipesel(pipe);
      buf = hw_usb_read_pipemaxp();

      /* Max Packet Size */

      size = (uint16_t)(buf & USB_MXPS);
    }

  return size;
}

/****************************************************************************
 * Name: usb_cstd_get_maxpacket_size
 *
 * Description:
 *   Get maxpacket size
 *
 ****************************************************************************/

static uint16_t usb_cstd_get_maxpacket_size(uint16_t pipe)
{
  uint16_t size;
  uint16_t buf;

  if (USB_MAXPIPE_NUM < pipe)
    {
      return USB_NULL; /* Error */
    }

  if (USB_PIPE0 == pipe)
    {
      buf = hw_usb_read_dcpmaxp();
    }
  else
    {
      /* Pipe select */

      hw_usb_write_pipesel(pipe);
      buf = hw_usb_read_pipemaxp();
    }

  /* Max Packet Size */

  size = (uint16_t)(buf & USB_MXPS);

  return size;
}

/****************************************************************************
 * Name: hw_usb_write_fifo16
 *
 * Description:
 *   Write FIFO16
 *
 ****************************************************************************/

static void hw_usb_write_fifo16(uint16_t pipemode, uint16_t data)
{
  switch (pipemode)
    {
      case USB_CUSE:
        USB0_CFIFO16 = data;
        break;
      case USB_D0USE:
        USB0_D0FIFO16 = data;
        break;
      case USB_D1USE:
        USB0_D1FIFO16 = data;
        break;
      default:
        break;
  }
}

/****************************************************************************
 * Name: hw_usb_write_fifo8
 *
 * Description:
 *   Write to FIFO8
 *
 ****************************************************************************/

static void hw_usb_write_fifo8(uint16_t pipemode, uint8_t data)
{
  switch (pipemode)
    {
      case USB_CUSE:
        USB0_CFIFO8 = data;
        break;
      case USB_D0USE:
        USB0_D0FIFO8 = data;
        break;
      case USB_D1USE:
        USB0_D1FIFO8 = data;
        break;
      default:
        break;
    }
}

/****************************************************************************
 * Name: usb_pstd_write_fifo
 *
 * Description:
 *   Write to FIFO
 *
 ****************************************************************************/

uint8_t *usb_pstd_write_fifo(uint16_t count, uint16_t pipemode,
                             uint8_t *write_p)
{
  uint16_t even;

  /* WAIT_LOOP */

  for (even = (uint16_t)(count >> 1); (0 != even); --even)
    {
      /* 16bit access */

      hw_usb_write_fifo16(pipemode, *((uint16_t *)write_p));

      /* Renewal write pointer */

      write_p += sizeof(uint16_t);
    }

  if ((count & (uint16_t)0x0001u) != 0u)
    {
      /* 8bit access */

      /* count == odd */

      /* Change FIFO access width */

      hw_usb_set_mbw(pipemode, USB_MBW_8);

      /* FIFO write */

      hw_usb_write_fifo8(pipemode, *write_p);

      /* Return FIFO access width */

      hw_usb_set_mbw(pipemode, USB_MBW_16);

