apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
     priv->ep0state = EP0STATE_WRREQUEST;
     rx65n_dispatchrequest(priv);
    }

  /* Handle standard request.  Pick off the things of interest to the
   * USB device controller driver; pass what is left to the class driver
   */

  switch (priv->ctrl.req)
    {
      case USB_REQ_GETSTATUS:
        {
          /* type:  device-to-host; recipient = device, interface, endpoint
           * value: 0
           * index: zero interface endpoint
           * len:   2; data = status
           */

          if ((0 == value.w) && (2 == len.w))
            {
              tbl[0] = 0;
              tbl[1] = 0;

              /* Check request type */

              switch (priv->ctrl.type & USB_REQ_RECIPIENT_MASK)
                {
                  case USB_REQ_RECIPIENT_ENDPOINT:
                    {
                      /* Endpoint number */

                      ep = (uint16_t)(index.w & USB_EPNUMFIELD);

                      /* Endpoint 0 */

                      if (0 == ep)
                        {
                          buf = hw_usb_read_dcpctr();
                          if ((uint16_t)0 != (buf & USB_PID_STALL))
                            {
                              /* Halt set */

                              tbl[0] = USB_GS_HALT;
                            }

                          /* Control read start */

                          usb_pstd_ctrl_read((uint32_t)2, tbl);
                        }

                      /* EP1 to max */

                      else if (ep <= USB_MAX_EP_NO)
                        {
                          if (USB_TRUE == usb_pstd_chk_configured())
                            {
                              pipe =
                                  usb_pstd_epadr2pipe(g_usb_pstd_req_index);
                              if (USB_ERROR == pipe)
                                {
                                  /* Set pipe USB_PID_STALL */

                                  usb_pstd_set_stall_pipe0();
                                }
                              else
                                {
                                  buf = usb_cstd_get_pid(pipe);
                                  if ((uint16_t)0 != (buf & USB_PID_STALL))
                                    {
                                      /* Halt set */

                                      tbl[0] = USB_GS_HALT;
                                    }

                                  /* Control read start */

                                  usb_pstd_ctrl_read((uint32_t)2, tbl);
                                }
                            }
                          else
                            {
                              /* Set pipe USB_PID_STALL */

                              usb_pstd_set_stall_pipe0();
                            }
                        }
                      else
                        {
                          /* Set pipe USB_PID_STALL */

                          usb_pstd_set_stall_pipe0();
                        }
                        break;

                      case USB_REQ_RECIPIENT_DEVICE:
                        {
                          if (0 == index.w)
                            {
                              /* Self powered / Bus powered */

                              tbl[0] = usb_pstd_get_current_power();

                              /* Support remote wakeup ? */

                              if (USB_TRUE == g_usb_pstd_remote_wakeup)
                                {
                                  tbl[0] |= USB_GS_REMOTEWAKEUP;
                                }

                              /* Control read start */

                              usb_pstd_ctrl_read((uint32_t)2, tbl);
                            }
                          else
                            {
                              /* Request error */

                              usb_pstd_set_stall_pipe0();
                            }
                        }
                        break;

                      case USB_REQ_RECIPIENT_INTERFACE:
                        {
                          if (USB_TRUE == usb_pstd_chk_configured())
                            {
                              /* 2 is number of interfaces,
                               * as configured by class driver
                               */

                              if (g_usb_pstd_req_index < 2)

                                {
                                  /* Control read start */

                                  usb_pstd_ctrl_read((uint32_t)2, tbl);
                                }
                              else
                                {
                                  /* Request error (not exist interface) */

                                  usb_pstd_set_stall_pipe0();
                                }
                            }
                          else
                            {
                              /* Request error */

                              usb_pstd_set_stall_pipe0();
                            }
                        }
                        break;

                      default:
                        {
                          usb_pstd_set_stall_pipe0();
                        }
                        break;
                    }
                }
            }
        }
        break;
      case USB_REQ_CLEARFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface or endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   zero, data = none
           */

          usbtrace(TRACE_INTDECODE(RX65N_TRACEINTID_CLEARFEATURE),
                   priv->ctrl.type);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) !=
              USB_REQ_RECIPIENT_ENDPOINT)
            {
              /* Let the class implementation handle all recipients
               * (except for the endpoint recipient)
               */

