apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
              rx65n_dispatchrequest(priv);
            }
          else
            {
              /* Endpoint recipient */

              epno = USB_EPNO(index.b[LSB]);
              if (USB_ENDPOINT_HALT == value.w)
                {
                  /* EP0 */

                  if (0 == epno)
                    {
                      /* Stall clear */

                      usb_cstd_clr_stall((uint16_t)USB_PIPE0);

                      /* Set pipe PID_BUF */

                      usb_cstd_set_buf((uint16_t)USB_PIPE0);
                    }

                  /* EP1 to max */

                  else if (epno <= USB_MAX_EP_NO)
                    {
                      pipe = usb_pstd_epadr2pipe(index.w);
                      if (USB_ERROR == pipe)
                        {
                          /* Request error */

                          usb_pstd_set_stall_pipe0();
                        }
                      else
                        {
                          if (USB_PID_BUF == usb_cstd_get_pid(pipe))
                            {
                              usb_cstd_set_nak(pipe);

                              /* SQCLR=1 */

                              hw_usb_set_sqclr(pipe);

                              /* Set pipe PID_BUF */

                              usb_cstd_set_buf(pipe);
                            }
                          else
                            {
                              usb_cstd_clr_stall(pipe);

                              /* SQCLR=1 */

                              hw_usb_set_sqclr(pipe);
                            }

                          /* Set pipe PID_BUF */

                          usb_cstd_set_buf((uint16_t)USB_PIPE0);
                        }
                    }
                  else
                    {
                      /* Request error */

                      usb_pstd_set_stall_pipe0();
                    }
                }
            }
        }
        break;

      case USB_REQ_SETFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface, endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   0; data = none
           */

          usbtrace(TRACE_INTDECODE(RX65N_TRACEINTID_SETFEATURE),
                   priv->ctrl.type);
          if (((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) ==
              USB_REQ_RECIPIENT_DEVICE) && value.w == USB_FEATURE_TESTMODE)
            {
              /* Special case recipient=device test mode */

              uinfo ("test mode: %d\n", index.w);
            }
          else if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) !=
                   USB_REQ_RECIPIENT_ENDPOINT)
            {
              /* The class driver handles all recipients
               * except recipient=endpoint
               */

              rx65n_dispatchrequest(priv);
            }
          else
            {
              /* Handler recipient=endpoint */

              epno = USB_EPNO(index.b[LSB]);
              if (USB_ENDPOINT_HALT == value.w)
                {
                  /* EP0 */

                  if (0 == epno)
                    {
                      /* Set pipe PID_BUF */

                      usb_cstd_set_buf((uint16_t)USB_PIPE0);
                    }

                  /* EP1 to max */

                  else if (epno <= USB_MAX_EP_NO)
                    {
                      pipe = usb_pstd_epadr2pipe(index.w);
                      if (USB_ERROR == pipe)
                        {
                          /* Request error */

                          usb_pstd_set_stall_pipe0();
                        }
                      else
                        {
                          /* Set pipe USB_PID_STALL */

                          usb_pstd_set_stall(pipe);

                          /* Set pipe PID_BUF */

                          usb_cstd_set_buf((uint16_t)USB_PIPE0);
                        }
                    }
                  else
                    {
                      /* Request error */

                      usb_pstd_set_stall_pipe0();
                    }
                }
              else
                {
                  /* Not specification */

                  usb_pstd_set_stall_pipe0();
                }
            }
        }
        break;

      case USB_REQ_SETADDRESS:
        {
          /* type:  host-to-device; recipient = device
           * value: device address
           * index: 0
           * len:   0; data = none
           */

          if ((0 == index.w) && (0 == len.w))
            {
              if (value.w <= 127)
                {
                  /* Set pipe PID_BUF */

                  usb_cstd_set_buf((uint16_t)USB_PIPE0);
                }
              else
                {
                  /* Not specification */

                  usb_pstd_set_stall_pipe0();
                }
            }
          else
            {
              /* Not specification */

              usb_pstd_set_stall_pipe0();
            }
        }
        break;

      case USB_REQ_GETDESCRIPTOR:
      case USB_REQ_SETDESCRIPTOR:
        /* type:  host-to-device; recipient = device
         * value: descriptor type and index
         * index: 0 or language ID;
         * len:   descriptor len; data = descriptor
         */

        {
          uinfo("Get Descriptor Request Got from Host");
          usbtrace(TRACE_INTDECODE(RX65N_TRACEINTID_GETCONFIG),
                   priv->ctrl.type);
          /* The request seems valid... let the class
           * implementation handle it
           */

          rx65n_dispatchrequest(priv);
        }
        break;

      case USB_REQ_GETCONFIGURATION:

        /* type:  device-to-host; recipient = device
         * value: 0;
         * index: 0;
         * len:   1; data = configuration value
         */

      case USB_REQ_SETCONFIGURATION:

        /* type:  host-to-device; recipient = device
         * value: configuration value
         * index: 0;
         * len:   0; data = none
         */

        {
          usbtrace(TRACE_INTDECODE(RX65N_TRACEINTID_SETCONFIG), 0);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) ==
              USB_REQ_RECIPIENT_DEVICE)
            {
              rx65n_dispatchrequest(priv);
            }
          else
            {
              usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_BADSETCONFIG), 0);
              priv->stalled = 1;
            }
        }
        break;

