apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
           ep->eplog = USB_EPOUT(epno);
           pipe_no = INT_OUT_PIPE;
           pipe_cfg_int = (uint16_t)(USB_TYPFIELD_INT | USB_DIR_P_OUT |
                                     epno);
         }
        break;

      case USB_EP_ATTR_XFER_BULK: /* Bulk endpoint */
        if (USB_ISEPIN(desc->addr) && epno == BULK_IN_EPNUM)
          {
            /* The full, logical EP number includes direction */

            ep->eplog = USB_EPIN(epno);
            pipe_no = BULK_IN_PIPE;
            pipe_cfg_bulkin = (uint16_t)(USB_TYPFIELD_BULK | USB_CFG_DBLB |
                                         USB_DIR_P_IN | epno);
          }

        if (USB_ISEPOUT(desc->addr))
          {
            /* The full, logical EP number includes direction */

            ep->eplog = USB_EPOUT(epno);
            pipe_no = BULK_OUT_PIPE;
            pipe_cfg_bulkout = (uint16_t)(USB_TYPFIELD_BULK | USB_CFG_DBLB |
                                          USB_SHTNAKFIELD | USB_DIR_P_OUT |
                                          epno);
          }

        break;

      case USB_EP_ATTR_XFER_ISOC: /* Isochronous endpoint */

        /* Not Supported */

        break;

      case USB_EP_ATTR_XFER_CONTROL: /* Control endpoint */
        hw_usb_write_dcpcfg(0);
        hw_usb_write_dcpmxps(USB_DCPMAXP);
        break;

      default:
        usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_BADEPTYPE),
                 (uint16_t)desc->type);
        return -EINVAL;
  }

  maxpacket = GETUINT16(desc->mxpacketsize);
  hw_usb_write_pipemaxp(maxpacket);
  ep->maxpacket = maxpacket;

  hw_usb_write_dcpmxps(USB_DCPMAXP);

  usb_pstd_set_pipe_reg(pipe_no, pipe_cfg_int, pipe_cfg_bulkin,
                        pipe_cfg_bulkout, maxpacket);

  return OK;
}

/****************************************************************************
 * Name: rx65n_epdisable
 *
 * Description:
 *   The endpoint will no longer be used
 *
 ****************************************************************************/

static int rx65n_epdisable(struct usbdev_ep_s *ep)
{
  struct rx65n_ep_s *privep = (struct rx65n_ep_s *)ep;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_INVALIDPARMS), 0);
      uerr("ERROR: ep=%p\n", ep);
      return -EINVAL;
    }
#endif

  /* Cancel any ongoing activity */

  flags = enter_critical_section();
  rx65n_cancelrequests(privep);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: rx65n_epallocreq
 *
 * Description:
 *   Allocate an I/O request
 *
 ****************************************************************************/

static struct usbdev_req_s *rx65n_epallocreq(struct usbdev_ep_s *ep)
{
  struct rx65n_req_s *privreq;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }

#endif
  usbtrace(TRACE_EPALLOCREQ, USB_EPNO(ep->eplog));

  privreq = kmm_malloc(sizeof(struct rx65n_req_s));
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_ALLOCFAIL), 0);
      return NULL;
    }

  memset(privreq, 0, sizeof(struct rx65n_req_s));
  return &privreq->req;
}

/****************************************************************************
 * Name: rx65n_epfreereq
 *
 * Description:
 *   Free an I/O request
 *
 ****************************************************************************/

static void rx65n_epfreereq(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct rx65n_req_s *privreq = (struct rx65n_req_s *)req;
#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_INVALIDPARMS), 0);
      return;
    }

#endif
  usbtrace(TRACE_EPFREEREQ, USB_EPNO(ep->eplog));
  kmm_free(privreq);
}

/****************************************************************************
 * Name: rx65n_epsubmit
 *
 * Description:
 *   Submit an I/O request to the endpoint
 *
 ****************************************************************************/

static int rx65n_epsubmit(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct rx65n_req_s *privreq = (struct rx65n_req_s *)req;
  struct rx65n_ep_s *privep = (struct rx65n_ep_s *)ep;
  struct rx65n_usbdev_s *priv;
  irqstate_t flags;
  uint8_t epno;
  int ret = OK;

#ifdef CONFIG_DEBUG_FEATURES
  if (!req || !req->callback || !req->buf || !ep)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_INVALIDPARMS), 0);
      printf("ERROR: req=%p callback=%p buf=%p ep=%p\n",
           req, req->callback, req->buf, ep);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPSUBMIT, USB_EPNO(ep->eplog));
  priv = privep->dev;

#ifdef CONFIG_DEBUG_FEATURES
  if (!priv->driver)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_NOTCONFIGURED),
               priv->usbdev.speed);
      printf("ERROR: driver=%p\n", priv->driver);
      return -ESHUTDOWN;
    }
#endif

  /* Handle the request from the class driver */

  epno        = USB_EPNO(ep->eplog);
  req->result = -EINPROGRESS;
  req->xfrd   = 0;
  flags       = enter_critical_section();

  /* If we are stalled, then drop all requests on the floor */

  if (privep->stalled)
    {
      rx65n_abortrequest(privep, privreq, -EBUSY);
      printf("ERROR: stalled\n");
      ret = -EBUSY;
    }

  /* Handle IN (device-to-host) requests.  NOTE:  If the class device is
   * using the bi-directional EP0, then we assume that they intend the EP0
   * IN functionality.
   */

  else if (epno == EP0)
    {
      /* Add the new request to the request queue for the IN endpoint */

      usbtrace(TRACE_INREQQUEUED(epno), req->len);
      rx65n_rqenqueue(privep, privreq);

      if (priv->ep0state == EP0STATE_RDREQUEST)
        {
          privreq->req.len = CDC_CLASS_DATA_LENGTH;
          rx65n_rdrequest(epno, priv, privep);
          leave_critical_section(flags);
          return OK;
        }

      /* If the IN endpoint FIFO is available, then transfer the data now */

      if (!privep->txbusy)
        {
          ret = rx65n_wrrequest(epno, priv, privep);
          leave_critical_section(flags);
          return OK;
        }
    }

