apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
static void usb_cstd_chg_curpipe(uint16_t pipe, uint16_t fifosel,
                                 uint16_t isel)
{
  uint16_t buf;

  /* Select FIFO */

  switch (fifosel)
    {
      /* CFIFO use */

      case USB_CUSE:

        /* ISEL=1, CURPIPE=0 */

        hw_usb_rmw_fifosel(USB_CUSE, ((USB_RCNT | isel) | pipe),
                           ((USB_RCNT | USB_ISEL) | USB_CURPIPE));
        break;

        /* D0FIFO use */

      case USB_D0USE:

        /* D1FIFO use */

      case USB_D1USE:

        /* DxFIFO pipe select */

        hw_usb_set_curpipe(fifosel, pipe);

        /* WAIT_LOOP */

        do
          {
            buf = hw_usb_read_fifosel(fifosel);
          }
        while ((uint16_t)(buf & USB_CURPIPE) != pipe);
        break;

      default:
        break;
    }
}

/****************************************************************************
 * Name: hw_usb_get_fifosel_adr
 *
 * Description:
 *   Get FIFOSEL register address
 *
 ****************************************************************************/

static void *hw_usb_get_fifosel_adr(uint16_t pipemode)
{
  void *p_reg = NULL;

  switch (pipemode)
    {
      case USB_CUSE:
        p_reg = (void *)RX65N_USB_CFIFOSEL;
        break;

      case USB_D0USE:
        p_reg = (void *)RX65N_USB_D0FIFOSEL;
        break;

      case USB_D1USE:
        p_reg = (void *)RX65N_USB_D1FIFOSEL;
        break;

      default:
        break;
    }

  return p_reg;
}

/****************************************************************************
 * Name: hw_usb_read_fifosel
 *
 * Description:
 *   Read FIFOSEL Register
 *
 ****************************************************************************/

static uint16_t hw_usb_read_fifosel(uint16_t pipemode)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifosel_adr(pipemode);

  return *p_reg;
}

/****************************************************************************
 * Name: hw_usb_set_trclr
 *
 * Description:
 *   Set Transaction Clear bit
 *
 ****************************************************************************/

static void hw_usb_set_trclr(uint16_t pipeno)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)(RX65N_USB_PIPE1CTR) + ((pipeno - 1) * 2);

  (*p_reg) |= USB_TRCLR;
}

/****************************************************************************
 * Name: hw_usb_clear_trenb
 *
 * Description:
 *   Clear Transaction Enable
 *
 ****************************************************************************/

static void hw_usb_clear_trenb(uint16_t pipeno)
{
  uint16_t *p_reg;

  p_reg = (uint16_t *)(RX65N_USB_PIPE1CTR) + ((pipeno - 1) * 2);
  (*p_reg) &= (~USB_TRENB);
}

/****************************************************************************
 * Name: usb_cstd_clr_transaction_counter
 *
 * Description:
 *   Clear Transaction Counter
 *
 ****************************************************************************/

static void usb_cstd_clr_transaction_counter(uint16_t trnreg)
{
  hw_usb_clear_trenb(trnreg);
  hw_usb_set_trclr(trnreg);
}

/****************************************************************************
 * Name: hw_usb_clear_bempenb
 *
 * Description:
 *   Clear BEMPENB
 *
 ****************************************************************************/

static void hw_usb_clear_bempenb(uint16_t pipeno)
{
  uint16_t regval;

  regval = rx65n_getreg16(RX65N_USB_BEMPENB);
  regval &= (~(1 << pipeno));
  rx65n_putreg16(regval, RX65N_USB_BEMPENB);
}

/****************************************************************************
 * Name: hw_usb_clear_nrdyenb
 *
 * Description:
 *   Clear NRDYENB
 *
 ****************************************************************************/

static void hw_usb_clear_nrdyenb(uint16_t pipeno)
{
  uint16_t regval;

  regval = rx65n_getreg16(RX65N_USB_NRDYENB);
  regval &= (~(1 << pipeno));
  rx65n_putreg16(regval, RX65N_USB_NRDYENB);
}

/****************************************************************************
 * Name: hw_usb_clear_brdyenb
 *
 * Description:
 *   Clear BRDYENB
 *
 ****************************************************************************/

static void hw_usb_clear_brdyenb(uint16_t pipeno)
{
  uint16_t regval;

  regval = rx65n_getreg16(RX65N_USB_BRDYENB);
  regval &= (~(1 << pipeno));
  rx65n_putreg16(regval, RX65N_USB_BRDYENB);
}

/****************************************************************************
 * Name: hw_usb_read_pipectr
 *
 * Description:
 *   Read PIPECTR
 *
 ****************************************************************************/

static uint16_t hw_usb_read_pipectr(uint16_t pipeno)
{
  uint16_t *p_reg;

  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)(RX65N_USB_PIPE1CTR) + (pipeno - 1);
    }

  return *p_reg;
}

/****************************************************************************
 * Name: hw_usb_clear_pid
 *
 * Description:
 *   Clear pid
 *
 ****************************************************************************/

static void hw_usb_clear_pid(uint16_t pipeno, uint16_t data)
{
  uint16_t *p_reg;

  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
       p_reg = (uint16_t *)(RX65N_USB_PIPE1CTR) + (pipeno - 1);
    }

  (*p_reg) &= (~data);
}

/****************************************************************************
 * Name: usb_cstd_set_nak
 *
 * Description:
 *   Set NAK
 *
 ****************************************************************************/

static void usb_cstd_set_nak(uint16_t pipe)
{
  uint16_t buf;
  uint16_t n;

  /* Set NAK */

  hw_usb_clear_pid(pipe, (uint16_t)USB_PID_BUF);

  /* The state of PBUSY continues while transmitting
   * the packet when it is a detach.
   */

  /* 1ms comes off when leaving because the packet
   * duration might not exceed 1ms.
   */

  /* Whether it is PBUSY release or
   * 1ms passage can be judged.
   */

  /* WAIT_LOOP */

  for (n = 0; n < 0xffff; ++n)
    {
      /* PIPE control reg read */

      buf = hw_usb_read_pipectr(pipe);
      if (0 == (uint16_t)(buf & USB_PBUSY))
        {
          n = 0xfffe;
        }
    }
}

/****************************************************************************
 * Name: usb_pstd_forced_termination
 *
 * Description:
 *   Clear the buffer data
 *
 ****************************************************************************/

void usb_pstd_forced_termination(uint16_t pipe, uint16_t status)
{
  uint16_t buf;

  /* PID = NAK */

  /* Set NAK */

  usb_cstd_set_nak(pipe);

  /* Disable Interrupt */

  /* Disable Ready Interrupt */

  hw_usb_clear_brdyenb(pipe);

  /* Disable Not Ready Interrupt */

