apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
  regval = rx65n_getreg16(RX65N_USB_USBLENG);

  return regval;
}

/****************************************************************************
 * Name: usb_pstd_save_request
 *
 * Description:
 *  Save the request
 *
 ****************************************************************************/

void usb_pstd_save_request(void)
{
  /* Valid clear */

  hw_usb_pclear_sts_valid();

  g_usb_pstd_req_type = hw_usb_read_usbreq();
  g_usb_pstd_req_value = hw_usb_read_usbval();
  g_usb_pstd_req_index = hw_usb_read_usbindx();
  g_usb_pstd_req_length = hw_usb_read_usbleng();
}

/****************************************************************************
 * Name: usb_pstd_set_stall
 *
 * Description:
 *  Set Stall status
 *
 ****************************************************************************/

void usb_pstd_set_stall(uint16_t pipe)
{
  /* PIPE control reg set */

  hw_usb_set_pid(pipe, USB_PID_STALL);
}

/****************************************************************************
 * Name: hw_usb_set_pid
 *
 * Description:
 *  Set PID
 *
 ****************************************************************************/

static void hw_usb_set_pid(uint16_t pipeno, uint16_t data)
{
  uint16_t *p_reg;

  if (USB_PIPE0 == pipeno)
    {
      p_reg = ((uint16_t *)(RX65N_USB_DCPCTR));
    }
  else
    {
      p_reg = ((uint16_t *)(RX65N_USB_PIPE1CTR)) + ((pipeno - 1));
    }

  (*p_reg) &= (~USB_PID);
  (*p_reg) |= data;
}

/****************************************************************************
 * Name: hw_usb_pset_ccpl
 *
 * Description:
 *  Set CCPL
 *
 ****************************************************************************/

void hw_usb_pset_ccpl(void)
{
  uint16_t regval;

  regval = rx65n_getreg16(RX65N_USB_DCPCTR);
  regval |= USB_CCPL;
  rx65n_putreg16(regval, RX65N_USB_DCPCTR);
}

/****************************************************************************
 * Name: usb_pstd_ctrl_end
 *
 * Description:
 *  CTRL End
 *
 ****************************************************************************/

void usb_pstd_ctrl_end(uint16_t status)
{
  /* Interrupt disable */

  /* BEMP0 disable */

  hw_usb_clear_bempenb((uint16_t)USB_PIPE0);

  /* BRDY0 disable */

  hw_usb_clear_brdyenb((uint16_t)USB_PIPE0);

  /* NRDY0 disable */

  hw_usb_clear_nrdyenb((uint16_t)USB_PIPE0);

  hw_usb_set_mbw(USB_CUSE, USB0_CFIFO_MBW);

  if ((USB_DATA_ERR == status) || (USB_DATA_OVR == status))
    {
      /* Request error */

      usb_pstd_set_stall_pipe0();
    }

  else if (USB_DATA_STOP == status)
    {
      /* Pipe stop */

      usb_cstd_set_nak((uint16_t)USB_PIPE0);
    }

  else
    {
      /* Set CCPL bit */

      hw_usb_pset_ccpl();
    }
}

/****************************************************************************
 * Name: usb_pstd_set_feature3
 *
 * Description:
 *  Handles the set feature request
 *
 ****************************************************************************/

static void usb_pstd_set_feature3(void)
{
  uint16_t pipe;
  uint16_t ep;

  if (0 == g_usb_pstd_req_length)
    {
      /* check request type */

      switch ((g_usb_pstd_req_type & USB_BMREQUESTTYPERECIP))
        {
          case USB_DEVICE:
            switch (g_usb_pstd_req_value)
              {
                case USB_DEV_REMOTE_WAKEUP:
                  if (0 == g_usb_pstd_req_index)
                    {
                      /* Set pipe PID_BUF */

                      usb_cstd_set_buf((uint16_t)USB_PIPE0);
                    }
                  else
                    {
                      /* Not specification */

                      usb_pstd_set_stall_pipe0();
                    }
                  break;
                case USB_TEST_MODE:
                  if (USB_HSCONNECT == usb_cstd_port_speed())
                    {
                      if ((g_usb_pstd_req_index < USB_TEST_RESERVED) ||
                          (USB_TEST_VSTMODES <= g_usb_pstd_req_index))
                        {
                          g_usb_pstd_test_mode_flag = USB_TRUE;
                          g_usb_pstd_test_mode_select = g_usb_pstd_req_index;

                          /* Set pipe PID_BUF */

                          usb_cstd_set_buf((uint16_t)USB_PIPE0);
                        }
                      else
                        {
                          /* Not specification */

                          usb_pstd_set_stall_pipe0();
                        }
                    }
                  else
                    {
                      /* Not specification */

                      usb_pstd_set_stall_pipe0();
                    }
                  break;
                default:
                  usb_pstd_set_stall_pipe0();
                  break;
              }
            break;
          case USB_INTERFACE:

            /* Set pipe USB_PID_STALL */

            usb_pstd_set_stall_pipe0();
            break;
          case USB_ENDPOINT:

            /* Endpoint number */

            ep = (uint16_t)(g_usb_pstd_req_index & USB_EPNUMFIELD);
            if (USB_ENDPOINT_HALT == g_usb_pstd_req_value)
              {
                /* EP0 */

                if (0 == ep)
                  {
                    /* Set pipe PID_BUF */

                    usb_cstd_set_buf((uint16_t)USB_PIPE0);
                  }

                /* EP1 to max */

                else if (ep <= USB_MAX_EP_NO)
                  {
                    pipe = usb_pstd_epadr2pipe(g_usb_pstd_req_index);
                    if (USB_ERROR == pipe)
                      {
                        /* Request error */

                        usb_pstd_set_stall_pipe0();
                      }
                    else
                      {
                        /* Set pipe USB_PID_STALL */

                        usb_pstd_set_stall(pipe);

                        /* Set pipe PID_BUF */

                        usb_cstd_set_buf((uint16_t)USB_PIPE0);
                      }
                  }
                else
                  {
                    /* Request error */

                    usb_pstd_set_stall_pipe0();
                  }
              }
            else
              {
                /* Not specification */

                usb_pstd_set_stall_pipe0();
              }
            break;

          default:

            /* Request error */

            usb_pstd_set_stall_pipe0();
            break;
        }
    }
  else
    {
      /* Request error */

      usb_pstd_set_stall_pipe0();
    }
}

/****************************************************************************
 * Name: usb_pstd_clr_feature3
 *
 * Description:
 *  Handles the clear feature request
 *
 ****************************************************************************/

static void usb_pstd_clr_feature3(void)
{
  uint16_t pipe;
  uint16_t ep;

  if (0 == g_usb_pstd_req_length)
    {
      /* check request type */

      switch ((g_usb_pstd_req_type & USB_BMREQUESTTYPERECIP))
        {
           case USB_DEVICE:
             if ((USB_DEV_REMOTE_WAKEUP == g_usb_pstd_req_value)
                && (0 == g_usb_pstd_req_index))
               {
                 usb_cstd_set_buf((uint16_t)USB_PIPE0);
               }
             else
               {
                 /* Not specification */

                 usb_pstd_set_stall_pipe0();
               }
             break;
           case USB_INTERFACE:

            /* Request error */

            usb_pstd_set_stall_pipe0();
            break;

           case USB_ENDPOINT:

