apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
             /* Endpoint number */

             ep = (uint16_t)(g_usb_pstd_req_index & USB_EPNUMFIELD);
             if (USB_ENDPOINT_HALT == g_usb_pstd_req_value)
               {
                 /* EP0 */

                 if (0 == ep)
                   {
                     /* Stall clear */

                     usb_cstd_clr_stall((uint16_t)USB_PIPE0);

                     /* Set pipe PID_BUF */

                     usb_cstd_set_buf((uint16_t)USB_PIPE0);
                   }

                 /* EP1 to max */

                 else if (ep <= USB_MAX_EP_NO)
                   {
                     pipe = usb_pstd_epadr2pipe(g_usb_pstd_req_index);
                     if (USB_ERROR == pipe)
                       {
                         /* Request error */

                         usb_pstd_set_stall_pipe0();
                       }
                     else
                       {
                         if (USB_PID_BUF == usb_cstd_get_pid(pipe))
                           {
                             usb_cstd_set_nak(pipe);

                             /* SQCLR=1 */

                             hw_usb_set_sqclr(pipe);

                             /* Set pipe PID_BUF */

                             usb_cstd_set_buf(pipe);
                           }
                         else
                           {
                             usb_cstd_clr_stall(pipe);

                             /* SQCLR=1 */

                             hw_usb_set_sqclr(pipe);
                            }

                            /* Set pipe PID_BUF */

                            usb_cstd_set_buf((uint16_t)USB_PIPE0);
                            if (USB_TRUE == g_usb_pstd_stall_pipe[pipe])
                              {
                                g_usb_pstd_stall_pipe[pipe] = USB_FALSE;
                              }
                           }
                       }
                 else
                   {
                     /* Request error */

                     usb_pstd_set_stall_pipe0();
                   }
               }
             else
               {
                 /* Request error */

                 usb_pstd_set_stall_pipe0();
               }
             break;
           default:
             usb_pstd_set_stall_pipe0();
             break;
        }
    }
  else
    {
      /* Not specification */

      usb_pstd_set_stall_pipe0();
    }
}

/****************************************************************************
 * Name: usb_pstd_set_address3
 *
 * Description:
 *  Handles the Set Address request
 *
 ****************************************************************************/

static void usb_pstd_set_address3(void)
{
  if (USB_DEVICE == (g_usb_pstd_req_type & USB_BMREQUESTTYPERECIP))
    {
      if ((0 == g_usb_pstd_req_index) && (0 == g_usb_pstd_req_length))
        {
          if (g_usb_pstd_req_value <= 127)
            {
              /* Set pipe PID_BUF */

              usb_cstd_set_buf((uint16_t)USB_PIPE0);
            }
          else
            {
              /* Not specification */

              usb_pstd_set_stall_pipe0();
            }
        }
      else
        {
          /* Not specification */

          usb_pstd_set_stall_pipe0();
        }
    }
  else
    {
      /* Request error */

      usb_pstd_set_stall_pipe0();
    }
}

/****************************************************************************
 * Name: usb_pstd_stand_req3
 *
 * Description:
 *  Handle standard request
 *
 ****************************************************************************/

void usb_pstd_stand_req3(void)
{
  uint16_t regval;
  struct rx65n_usbdev_s *priv = &g_usbdev;
  regval = MSBYTE(g_usb_pstd_req_type);

  switch (regval)
    {
      case USB_REQ_CLEARFEATURE:
        usb_pstd_clr_feature3();
        break;

      case USB_REQ_SETFEATURE:
        usb_pstd_set_feature3();
        break;

     case USB_REQ_SETADDRESS:
       usb_pstd_set_address3();
       break;

     case USB_REQ_SETCONFIGURATION:
       usb_cstd_set_buf((uint16_t)USB_PIPE0);      /* SetConfiguration3 */
       break;

     case USB_REQ_SETINTERFACE:
       /* Let the class implementation handle
        * as it requires access and updation of
        * Configuration descriptor
        */

       rx65n_dispatchrequest(priv);
       break;

    default:
      break;
    }

  usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* Control transfer stop(end) */
}

/****************************************************************************
 * Name: usb_pstd_stand_req4
 *
 * Description:
 *  Handle standard request
 *
 ****************************************************************************/

void usb_pstd_stand_req4(void)
{
  uint16_t regval;

  regval = MSBYTE(g_usb_pstd_req_type);
  switch (regval)
    {
      case USB_REQ_GETSTATUS:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetStatus4 */
        break;

      case USB_REQ_GETDESCRIPTOR:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetDescriptor4 */
        break;

      case USB_REQ_GETCONFIGURATION:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetConfiguration4 */
        break;

      case USB_REQ_GETINTERFACE:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* GetInterface4 */
        break;

      case USB_REQ_SYNCHFRAME:
        usb_cstd_set_buf((uint16_t) USB_PIPE0);          /* SynchFrame4 */
        break;

      default:
        break;
    }

  usb_pstd_ctrl_end((uint16_t)USB_CTRL_END);
}

/****************************************************************************
 * Name: usb_peri_class_request
 *
 * Description:
 *  Handle Class Request
 *
 ****************************************************************************/

void usb_peri_class_request(uint8_t type, uint16_t ctsq)
{
  if ((USB_CLASS == (type & USB_BMREQUESTTYPETYPE)) ||
      (USB_VENDOR == (type & USB_BMREQUESTTYPETYPE)))
    {
      switch (ctsq)
        {
          case USB_CS_IDST:
          case USB_CS_RDDS:
          case USB_CS_WRDS:

            /* Do Nothing */

            break;
          case USB_CS_WRND:
            usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* class request (control write nodata status stage) */
            break;

          case USB_CS_RDSS:
            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* class request (control read status stage) */
            break;

          case USB_CS_WRSS:
            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            usb_pstd_ctrl_end((uint16_t)USB_CTRL_END); /* class request (control write status stage) */
            break;

          case USB_CS_SQER:
            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR); /* End control transfer. */
            break;

          default:
            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR); /* End control transfer. */
            break;
        }
    }
}

/****************************************************************************
 * Name: hw_usb_read_fifo16
 *
 * Description:
 *  Read FIFO16
 *
 ****************************************************************************/

static uint16_t hw_usb_read_fifo16(uint16_t pipemode)
{
  uint16_t data = 0;

  switch (pipemode)
    {
       case USB_CUSE:
         data = USB0.CFIFO.WORD;
         break;

       default:
         break;
    }

