apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
      switch (usb_pstd_read_data(USB_PIPE0, USB_CUSE))
        {
          /* End of data read */

          case USB_READEND:

            /* Continue */

            /* End of data read */

          case USB_READSHRT:
            hw_usb_clear_brdyenb((uint16_t)USB_PIPE0);
            break;

            /* Continue of data read */

          case USB_READING:

            /* PID = BUF */

            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            break;

            /* FIFO access error */

          case USB_READOVER:

            /* Clear BVAL */

            hw_usb_set_bclr(USB_CUSE);

            /* Control transfer stop(end) */

            usb_pstd_ctrl_end((uint16_t)USB_DATA_OVR);
            break;

            /* FIFO access error */

          case USB_ERROR:

            /* Control transfer stop(end) */

            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
            break;
          default:
            break;
        }
    }
  else
    {
      /* not PIPE0 */

      usb_pstd_brdy_pipe_process(bitsts);
      epno = BULK_IN_EPNUM;
      nbytes = RX65N_USB_MAXP - g_usb_pstd_data_cnt[BULK_OUT_PIPE];
      usb_data_write(epno, g_buffer, nbytes);
      rx65n_putreg16(0, RX65N_USB_BRDYSTS);
      privep->head->req.buf = g_buffer;

      /* EP3 is passed, because for read(),
       * the endpoint list should
       * always point to bulk out endpoint
       */

      privep = &priv->eplist[EP3];
      usb_data_read(g_buffer, RX65N_MAXPACKET_SIZE);
      bytesread = nbytes;

      /* The rx65n_rdrequest() function is invoked here
       * to handle application specific read()
       * and invoke the reqcomplete() function
       * which further, unblocks the semaphore waiting
       * on read()
       * Failing to invoke this function will result,
       * in failure of application specific read.
       *
       */

      rx65n_rdrequest(epno, priv, privep);
      bytesread = 0;
    }
}

/****************************************************************************
 * Name: usb_cstd_get_pid
 *
 * Description:
 *  Get PID
 *
 ****************************************************************************/

static uint16_t usb_cstd_get_pid(uint16_t pipe)
{
  uint16_t buf;

  if (USB_MAXPIPE_NUM < pipe)
    {
      return USB_NULL; /* Error */
    }

  /* PIPE control reg read */

  buf = hw_usb_read_pipectr(pipe);
  return (uint16_t)(buf & USB_PID);
}

/****************************************************************************
 * Name: usb_pstd_bemp_pipe_process
 *
 * Description:
 *  BEMP Interrupt Handling for Pipe
 *
 ****************************************************************************/

void usb_pstd_bemp_pipe_process(uint16_t bitsts)
{
  uint16_t buf;
  uint16_t i;

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_PIPE5; i++)
    {
      if (0 != (bitsts & USB_BITSET(i)))
        {
          hw_usb_clear_status_bemp(i);

          /* Interrupt check */

          if ((USB_NULL != g_p_usb_pstd_pipe[i]))
            {
              buf = usb_cstd_get_pid(i);

              /* MAX packet size error ? */

              if (USB_PID_STALL == (buf & USB_PID_STALL))
                {
                   usb_pstd_forced_termination(i, (uint16_t)USB_DATA_STALL);
                }
              else
                {
                  if (USB_INBUFM != (hw_usb_read_pipectr(i) & USB_INBUFM))
                    {
                      usb_pstd_data_end(i, (uint16_t)USB_DATA_NONE);
                    }
                  else
                    {
                      /* set BEMP enable */

                      hw_usb_set_bempenb(i);
                    }
                }
            }
        }
    }

  /* WAIT_LOOP */

  for (i = USB_PIPE6; i <= USB_MAXPIPE_NUM; i++)
    {
      /* Interrupt check */

      if (0 != (bitsts & USB_BITSET(i)))
        {
          if (USB_NULL != g_p_usb_pstd_pipe[i])
            {
              buf = usb_cstd_get_pid(i);

              /* MAX packet size error ? */

              if (USB_PID_STALL == (buf & USB_PID_STALL))
                {
                  usb_pstd_forced_termination(i, (uint16_t)USB_DATA_STALL);
                }
              else
                {
                  /* End of data transfer */

                  usb_pstd_data_end(i, (uint16_t)USB_DATA_NONE);
                }
            }
        }
    }
}

/****************************************************************************
 * Name: usb_pstd_bemp_pipe
 *
 * Description:
 *  BEMP Interrupt Handling
 *
 ****************************************************************************/

void usb_pstd_bemp_pipe(uint16_t bitsts)
{
  if (USB_BEMP0 == (bitsts & USB_BEMP0))
    {
      switch (usb_pstd_write_data(USB_PIPE0, USB_CUSE))
        {
          /* End of data write (not null) */

          case USB_WRITEEND:

            /* Continue */

            /* End of data write */

          case USB_WRITESHRT:

            /* Enable empty interrupt */

            hw_usb_clear_bempenb((uint16_t)USB_PIPE0);
            break;

            /* Continue of data write */

          case USB_WRITING:

            /* PID = BUF */

            usb_cstd_set_buf((uint16_t)USB_PIPE0);
            break;

            /* FIFO access error */

          case USB_ERROR:

            /* Control transfer stop(end) */

            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
            break;

          default:
            break;
        }
    }
  else
    {
      /* BEMP interrupt */

      usb_pstd_bemp_pipe_process(bitsts);
    }
}

/****************************************************************************
 * Name: hw_usb_read_frmnum
 *
 * Description:
 *  Read Framenum
 *
 ****************************************************************************/

static uint16_t hw_usb_read_frmnum(void)
{
  return rx65n_getreg16(RX65N_USB_FRMNUM);
}

/****************************************************************************
 * Name: usb_pstd_nrdy_pipe_process
 *
 * Description:
 *  NRDY Pipe Prrocess
 *
 ****************************************************************************/

