apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
void usb_pstd_nrdy_pipe_process(uint16_t bitsts)
{
  uint16_t buf;
  uint16_t i;

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_MAXPIPE_NUM; i++)
    {
      if (0 != (bitsts & USB_BITSET(i)))
        {
          /* Interrupt check */

          if (USB_NULL != g_p_usb_pstd_pipe[i])
            {
              if (USB_TYPFIELD_ISO == usb_cstd_get_pipe_type(i))
                {
                  /* Wait for About 60ns */

                  buf = hw_usb_read_frmnum();
                  if (USB_OVRN == (buf & USB_OVRN))
                    {
                      /* @1 */

                      /* End of data transfer */

                      usb_pstd_forced_termination(i, (uint16_t)USB_DATA_OVR);
                    }
                  else
                    {
                      /* @2 */

                      /* End of data transfer */

                      usb_pstd_forced_termination(i, (uint16_t)USB_DATA_ERR);
                    }
                }
              else
                {
                  /* Non processing. */
                }
            }
        }
    }
}

/****************************************************************************
 * Name: rx65n_usbdev_bottomhalf
 *
 * Description:
 *  BRDY handler in bottom half
 *
 ****************************************************************************/

static void rx65n_usbdev_bottomhalf(void *arg)
{
  struct rx65n_usbdev_s *priv = &g_usbdev;
  uint32_t bottom_half_processing = (uint32_t)arg;
  struct rx65n_ep_s *privep;

  if (bottom_half_processing == USB_INT_BRDY)
    {
      uint16_t regval;
      uint8_t epno;
      uint16_t brdysts;

      brdysts = USB0.BRDYSTS.WORD;
      regval = rx65n_getreg16(RX65N_USB_PIPECFG);
      regval &= USB_EPNUMFIELD;
      epno = regval;
      privep =  &priv->eplist[epno];
      usb_pstd_brdy_pipe(brdysts, priv, privep, epno);
    }
}

/****************************************************************************
 * Name: usb_pstd_nrdy_pipe
 *
 * Description:
 *  NRDY Interrupt handler
 *
 ****************************************************************************/

void usb_pstd_nrdy_pipe(uint16_t bitsts)
{
  /* Nrdy Pipe interrupt */

  usb_pstd_nrdy_pipe_process(bitsts);
}

/****************************************************************************
 * Name: rx65n_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int rx65n_usbinterrupt(int irq, void *context, void *arg)
{
  struct rx65n_usbdev_s *priv = &g_usbdev;

  uint8_t type;
  uint16_t ists0;
  uint16_t intenb0;
  uint16_t intsts0;
  uint16_t stginfo;
  uint16_t bempsts;
  uint16_t nrdysts;
  static uint32_t connected_times = 0;

  intenb0 = rx65n_getreg16(RX65N_USB_INTENB0);

  /* Read Interrupt Status and mask out interrupts that are not enabled. */

  intsts0 = rx65n_getreg16(RX65N_USB_INTSTS0) & intenb0;
  nrdysts = rx65n_getreg16(RX65N_USB_NRDYSTS);
  bempsts = rx65n_getreg16(RX65N_USB_BEMPSTS);

  /* Check VBUS */

  if ((intsts0 & RX65N_USB_INTSTS0_VBINT) == RX65N_USB_INTSTS0_VBINT)
    {
      rx65n_putreg16(
          ((~RX65N_USB_INTSTS0_VBINT) & INTSTS0_BIT_VALUES_TO_DETECT),
          RX65N_USB_INTSTS0);

      if (USB_ATTACH == usb_pstd_chk_vbsts())
        {
          priv->attached = 1;
          connected_times++;
          syslog(LOG_INFO, "NuttX: USB Device Connected. %d\n",
                 connected_times);
          uinfo("Device attached\n");
          usb_pstd_attach_process(); /* USB attach */
        }
      else
        {
          priv->attached = 0;
          syslog(LOG_INFO, "NuttX: USB Device Disconnected. %d\n",
                 connected_times);
          usb_pstd_detach_process(); /* USB detach */
          if (priv->driver)
            {
              CLASS_DISCONNECT(priv->driver, &priv->usbdev);
            }
        }
    }

  intsts0 = rx65n_getreg16(RX65N_USB_INTSTS0);
  if ((intsts0 & RX65N_USB_INTSTS0_DVST) == RX65N_USB_INTSTS0_DVST)
    {
      rx65n_putreg16(
          ((~RX65N_USB_INTSTS0_DVST) & INTSTS0_BIT_VALUES_TO_DETECT),
          RX65N_USB_INTSTS0);

      switch ((uint16_t)(intsts0 & USB_DVSQ))
        {
          /* Power state  */

          case USB_DS_POWR:
            break;

            /* Default state  */

          case USB_DS_DFLT:
            uinfo("USB-reset int peri\n");
            usb_pstd_bus_reset();
            break;

            /* Address state  */

          case USB_DS_ADDS:
            break;

            /* Configured state  */

          case USB_DS_CNFG:
            uinfo("Device configuration int peri\n");
            break;

            /* Power suspend state */

          case USB_DS_SPD_POWR:

            /* Continue */

            /* Default suspend state */

          case USB_DS_SPD_DFLT:

            /* Continue */

            /* Address suspend state */

          case USB_DS_SPD_ADDR:

            /* Continue */

            /* Configured Suspend state */

          case USB_DS_SPD_CNFG:
            uinfo("SUSPEND int peri\n");
            usb_pstd_suspend_process();
            break;

            /* Error */

          default:
            break;
        }
    }

  intsts0 = rx65n_getreg16(RX65N_USB_INTSTS0);
  if ((intsts0 & RX65N_USB_INTSTS0_CTRT) == RX65N_USB_INTSTS0_CTRT)
    {
      rx65n_putreg16
        (((~RX65N_USB_INTSTS0_CTRT) & INTSTS0_BIT_VALUES_TO_DETECT),
                     RX65N_USB_INTSTS0);

      stginfo = (uint16_t)(rx65n_getreg16(RX65N_USB_INTSTS0) & USB_CTSQ);

      if (((USB_CS_RDDS == stginfo) || (USB_CS_WRDS == stginfo))
          || (USB_CS_WRND == stginfo))
        {
          /* Save request register */

          usb_pstd_save_request();
        }

      if (USB_REQ_TYPE_STANDARD ==
          (g_usb_pstd_req_type & USB_BMREQUESTTYPETYPE))
        {
          /* Switch on the control transfer stage (CTSQ). */

          switch (stginfo)
            {
              /* Idle or setup stage */

              uinfo("stginfo =%d\n", stginfo);
              case USB_CS_IDST:
              case USB_CS_RDDS:
              case USB_CS_WRDS:
              case USB_CS_WRSS:

