apache/nuttx/arch/renesas/src/rx65n/rx65n_usbdev.c
                rx65n_ep0setup(priv);
                break;

              case USB_CS_RDSS:
                usb_pstd_stand_req4();
                break;

              case USB_CS_WRND:
                usb_pstd_stand_req3();
                break;

              /* Control sequence error */

              case USB_CS_SQER:
                usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
                break;

            /* Illegal */

          default:
            usb_pstd_ctrl_end((uint16_t)USB_DATA_ERR);
            break;
          }
      }
    else
      {
        /* Vendor Specific */

        type = LSBYTE(rx65n_getreg16(RX65N_USB_USBREQ));
        rx65n_ep0setup(priv);
        usb_peri_class_request(type, stginfo);
      }
  }

  ists0 = (uint16_t)(intsts0 & intenb0);

  /* BRDY Interrupt Check */

  if (USB_BRDY == (ists0 & USB_BRDY))
    {
      DEBUGVERIFY(work_queue(HPWORK, &g_usbdev.rx65n_interrupt_bhalf,
                             rx65n_usbdev_bottomhalf,
                             (void *)USB_INT_BRDY, 0));
    }

  /* BEMP Interrupt Check */

  if ((USB_BEMP == (ists0 & USB_BEMP)))
    {
      usb_pstd_bemp_pipe_process(bempsts);
    }

  /* NRDY Interrupt Check */

  if ((((intsts0 & intenb0) & RX65N_USB_INTSTS0_NRDY)) ==
      RX65N_USB_INTSTS0_NRDY)
    {
      usb_pstd_nrdy_pipe(nrdysts);
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: renesas_usbinitialize
 *
 * Description:
 *   Initialize USB hardware
 *
 ****************************************************************************/

void renesas_usbinitialize(void)
{
  /* For now there is only one USB controller, but we will always refer to
   * it using a pointer
   */

  struct rx65n_usbdev_s *priv = &g_usbdev;
  uint32_t reg32;
  uint16_t regval;
  int epno;
  usbtrace(TRACE_DEVINIT, 0);

  /* Enable write to System registers */

  regval = rx65n_getreg16(RX65N_PRCR_ADDR);

  rx65n_putreg16(RX65N_PRCR_VALUE, RX65N_PRCR_ADDR);
  regval = rx65n_getreg16(RX65N_PRCR_ADDR);

  /* Clear bit 19 - so that USB module is released from stop state */

  reg32 = getreg32(RX65N_MSTPCRB_ADDR);
  reg32 &= (~RX65N_MSTPCRB_START_STOP_USB);
  putreg32(reg32, RX65N_MSTPCRB_ADDR);

  memset(priv, 0, sizeof(struct rx65n_usbdev_s));
  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->eplist[EP0].ep;
  priv->epavail    = RX65N_ENDP_ALLSET & ~RX65N_ENDP_BIT(EP0);

  /* Initialize the endpoint list */

  for (epno = 0; epno < RX65N_NENDPOINTS; epno++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the (physical) endpoint number which is just the index to the
       * endpoint.
       */

      priv->eplist[epno].ep.ops   = &g_epops;
      priv->eplist[epno].dev      = priv;
      priv->eplist[epno].ep.eplog = epno;

      /* We will use a fixed maxpacket size for all endpoints (perhaps
       * ISOC endpoints could have larger maxpacket???).  A smaller
       * packet size can be selected when the endpoint is configured.
       */

      priv->eplist[epno].ep.maxpacket = RX65N_MAXPACKET_SIZE;
    }

  /* Select a smaller endpoint size for EP0 */

#if RX65N_EP0MAXPACKET < RX65N_MAXPACKET_SIZE
  priv->eplist[EP0].ep.maxpacket = RX65N_EP0MAXPACKET;
#endif

  /* Set SCKE bit in SYSCFG Register */

  regval = rx65n_getreg16(RX65N_USB_SYSCFG);
  regval |= (RX65N_USB_SYSCFG_SCKE);
  rx65n_putreg16(regval, RX65N_USB_SYSCFG);

  regval = rx65n_getreg16(RX65N_USB_PHYSLEW);
  regval |= (RX65N_PHYSLEW_VALUE);
  rx65n_putreg16(regval, RX65N_USB_PHYSLEW);

  /* Set USBE bit in SYSCFG register */

  regval = rx65n_getreg16(RX65N_USB_SYSCFG);
  regval |= (RX65N_USB_SYSCFG_USBE);
  rx65n_putreg16(regval, RX65N_USB_SYSCFG);

  /* Set MBW bit in CFIFOSEL register */

  regval = rx65n_getreg16(RX65N_USB_CFIFOSEL);
  regval |= (RX65N_USB_CFIFOSEL_MBW_16);
  rx65n_putreg16(regval, RX65N_USB_CFIFOSEL);

  /* Set MBW bit in D0FIFOSEL register */

  regval = rx65n_getreg16(RX65N_USB_D0FIFOSEL);
  regval |= (RX65N_USB_D0FIFOSEL_MBW_16);
  rx65n_putreg16(regval, RX65N_USB_D0FIFOSEL);

  /* Set MBW bit in D1FIFOSEL register */

  regval = rx65n_getreg16(RX65N_USB_D1FIFOSEL);
  regval |= (RX65N_USB_D1FIFOSEL_MBW_16);
  rx65n_putreg16(regval, RX65N_USB_D1FIFOSEL);

  /* Set the Interrupt enable bits in INTENB0 register */

  regval = rx65n_getreg16(RX65N_USB_INTENB0);
  regval |= (RX65N_USB_INTENB0_BEMPE | RX65N_USB_INTENB0_BRDYE |
             RX65N_USB_INTENB0_VBSE | RX65N_USB_INTENB0_DVSE |
             RX65N_USB_INTENB0_CTRE);
  rx65n_putreg16(regval, RX65N_USB_INTENB0);

  ICU.SLIBR185.BYTE = RX65N_USBI0_SOURCE;

  IPR(PERIB, INTB185) = RX65N_USBI0_PRIORITY;

  if (irq_attach(RX65N_INTB185_IRQ, rx65n_usbinterrupt, NULL) != 0)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_IRQREGISTRATION),
               (uint16_t)RX65N_INTB185_IRQ);
    }

  priv->usbdev.speed = USB_SPEED_FULL;

  syslog(LOG_INFO, "Debug:USB Device Initialized, Device connected:%s\n",
         priv->attached ? "YES" : "NO");
}

/****************************************************************************
 * Name: renesas_usbuninitialize
 * Description:
 *   Initialize the USB driver
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void renesas_usbuninitialize(void)
{
  struct rx65n_usbdev_s *priv = &g_usbdev;

  usbtrace(TRACE_DEVUNINIT, 0);
  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_DRIVERREGISTERED), 0);
      usbdev_unregister(priv->driver);
    }

  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Disable and detach IRQs */

  IEN(PERIB, INTB185) = 0U;

  irq_detach(RX65N_INTB185_IRQ);
}

/****************************************************************************
 * Name: usbdevclass_register
 *
 * Description:
 *   Register a USB device class driver. The class driver's
 *   bind() method will be
 *   called to bind it to a USB device driver.
 *
 ****************************************************************************/

int usbdev_register(struct usbdevclass_driver_s *driver)
{
  int ret;

  usbtrace(TRACE_DEVREGISTER, 0);

#ifdef CONFIG_DEBUG_USB
  if (!driver || !driver->ops->bind || !driver->ops->unbind ||
      !driver->ops->disconnect || !driver->ops->setup)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }

  if (g_usbdev.driver)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_DRIVER), 0);
      return -EBUSY;
    }
#endif

  /* First hook up the driver */

  g_usbdev.driver = driver;

  /* Then bind the class driver */

  ret = CLASS_BIND(driver, &g_usbdev.usbdev);
  if (ret)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_BINDFAILED), (uint16_t)-ret);
      g_usbdev.driver = NULL;
    }
  else
    {
      /* Enable USB controller interrupts */

      IEN(PERIB, INTB185) = 1U;
    }

  return ret;
}

/****************************************************************************
 * Name: usbdev_unregister
 *
 * Description:
 *   Un-register usbdev class driver.If the USB device is connected
 *   to a USB host, it will first disconnect().  The driver is
 *   also requested to unbind() and clean
 *   up any device state, before this procedure finally returns.
 *
 ****************************************************************************/

int usbdev_unregister(struct usbdevclass_driver_s *driver)
{
  usbtrace(TRACE_DEVUNREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (driver != g_usbdev.driver)
    {
      usbtrace(TRACE_DEVERROR(RX65N_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Unbind the class driver */

  CLASS_UNBIND(driver, &g_usbdev.usbdev);

  /* Disable IRQs */

  IEN(PERIB, INTB185) = 0U;

  /* Unhook the driver */

  g_usbdev.driver = NULL;
  return OK;
}
